src/test/resources/apiXml/JLR/GetJobsByEvhcFilteredByID.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <soap:Body>
      <getJobsByEvhc xmlns="http://www.cliffordthames.com/ebusiness/menus/">
         <jobsByEvhcRequest>
            <dealerDetails countryCode="GB" dealerIdentificationCode="GBdummy02" languageCode="EN" manufacturer="" password="Password1234" user="Support"/>
            <!--Clifford Thames TEST evhc details>-->
            <evhcProviderDetails id="102" password="Hammer999"/>
            <vehicleMatch>
               <!--Optional:
               <regMatch>FE11YOC</regMatch>-->
               <vinMatch>SAJAA0021DNU05832</vinMatch>
            </vehicleMatch>
            <job core="true" description="" id="70" jobDifficulty="1" jobSource="MAN" service="false"/>
         </jobsByEvhcRequest>
      </getJobsByEvhc>
   </soap:Body>
</soap:Envelope>